OpenFOAM/airFoil2D_05/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/gregor/FOAMProj/";
    case            "Wing";
    instance        "0";
    local           "";

    class           volScalarField;
    object          nuTilda;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
  body
  {
    type fixedValue;
    value uniform 0;
  }
  exterior
  {
    type freestream;
    freestreamValue uniform 1e-8;
  }
  sides
  {
    type empty;
  }
}


// ************************************************************************* //
