OpenFOAM/airFoil2D_05/constant/polyMesh/boundary
FoamFile
{
    version 2.0;
    format ascii;
    class polyBoundaryMesh;
    location "constant/polyMesh";
    object boundary;
}
// * * * * * * * * * * //


3
(
body
{
    type wall;
    nFaces 408;
    startFace 91800;
}
exterior
{
    type patch;
    nFaces 408;
    startFace 92208;
}
sides
{
    type empty;
    nFaces 92208;
    startFace 92616;
}
)


// * * * * * * * * * * //


